# 빅데이터 분석기사 실기 준비 놀이터
- https://www.kaggle.com/datasets/agileteam/bigdatacertificationkr

## T1-25. dataq 공식예제

### 25.  작업형1 예시문제
- 데이터셋 : mtcars.csv
- qsec 컬럼을 Min-Max Scale로 변환 후 0.5보다 큰 값을 가지는 레코드(row) 수를 묻는 문제
- https://www.kaggle.com/code/agileteam/tutorial-t1-python/notebook

In [1]:
import numpy as np
import pandas as pd

from sklearn.preprocessing import MinMaxScaler

In [2]:
df = pd.read_csv('./data/mtcars.csv')

display(df.head(), df.shape)

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

(32, 12)

In [3]:
scaler = MinMaxScaler()
df['qsec'] = scaler.fit_transform(df[['qsec']])

len(df[df['qsec'] > 0.5])

9

## T1-26. Exam Question (2nd round) / 기출 (2회차)
- 데이터셋 : basic1.csv
- https://www.kaggle.com/code/agileteam/tutorial-t1-2-python/notebook

### Question 1
- 데이터셋(basic1.csv)의 'f5' 컬럼을 기준으로 상위 10개의 데이터를 구하고,
- 'f5'컬럼 10개 중 최소값으로 데이터를 대체한 후,
- 'age'컬럼에서 80 이상인 데이터의'f5 컬럼 평균값 구하기

In [4]:
import numpy as np
import pandas as pd

import warnings
warnings.filterwarnings('ignore')

In [5]:
df = pd.read_csv('./data/basic1.csv')

display(df.head(), df.shape)

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

(100, 8)

In [6]:
top10_min = df.sort_values('f5', ascending=False).head(10)['f5'].min()
df['f5'][:10] = top10_min

df[df['age'] >= 80]['f5'].mean()

62.76223596304349

> 값이 차이나는 이유
- 해당 출제자는 상위 10개 데이터를 최소값으로 대체
- 나는 정렬되지 않은 기존 데이터의 첫번째 행부터 10개 데이터를 최소값으로 대체

### Question 2
- 데이터셋(basic1.csv)의 앞에서 순서대로 70% 데이터만 활용해서,
- 'f1'컬럼 결측치를 중앙값으로 채우기 전후의 표준편차를 구하고
- 두 표준편차 차이 계산하기

In [7]:
import numpy as np
import pandas as pd

In [8]:
df = pd.read_csv('./data/basic1.csv')

display(df.head(), df.shape)

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

(100, 8)

In [9]:
df = df[:70]

bf_std = df['f1'].std()
df['f1'] = df['f1'].fillna(df['f1'].median())
af_std = df['f1'].std()

print(bf_std - af_std)

3.2965018033960725

### Question 3
- 데이터셋(basic1.csv)의 'age'컬럼의 이상치를 더하시오!
- 단, 평균으로부터 '표준편차*1.5'를 벗어나는 영역을 이상치라고 판단함

In [10]:
import numpy as np
import pandas as pd

In [11]:
df = pd.read_csv('./data/basic1.csv')

display(df.head(), df.shape)

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

(100, 8)

In [12]:
mean = df['age'].mean()
std = df['age'].std() * 1.5

upper = mean+std
lower = mean-std

df[(df['age'] > upper) | (df['age'] < lower)]['age'].sum()

473.5

## T1-27. [MOCK EXAM1] TYPE1 / 작업형1 모의고사
- 데이터셋 : basic1.csv
- https://www.kaggle.com/code/agileteam/mock-exam1-type1-1-tutorial/notebook

### Question 1
- 첫번째 데이터 부터 순서대로 50:50으로 데이터를 나누고, 앞에서 부터 50%의 데이터(이하, A그룹)는 'f1'컬럼을 A그룹의 중앙값으로 채우고, 
- 뒤에서부터 50% 데이터(이하, B그룹)는 'f1'컬럼을 B그룹의 최대값으로 채운 후, A그룹과 B그룹의 표준편차 합을 구하시오
- 단, 소수점 첫째자리까지 구하시오 (둘째자리에서 반올림)

In [13]:
import numpy as np
import pandas as pd

In [14]:
df = pd.read_csv('./data/basic1.csv')

display(df.head(), df.shape)

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

(100, 8)

In [15]:
df_a = df.iloc[:50]
df_b = df.iloc[50:]

df_a.shape, df_b.shape

((50, 8), (50, 8))

In [16]:
df_a['f1'] = df_a['f1'].fillna(df_a['f1'].median())
df_b['f1'] = df_b['f1'].fillna(df_b['f1'].max())

std_a = df_a['f1'].std()
std_b = df_b['f1'].std()

print(round(std_a + std_b), 1)

42 1

### Question 2
- 'f4'컬럼을 기준 내림차순 정렬과 'f5'컬럼기준 오름차순 정렬을 순서대로 다중 조건 정렬하고나서 
- 앞에서부터 10개의 데이터 중 'f5'컬럼의 최소값 찾고, 이 최소값으로 앞에서 부터 10개의 'f5'컬럼 데이터를 변경함. 
- 그리고 'f5'컬럼의 평균값을 계산, 단 소수점 둘째자리까지 출력(셋째자리에서 반올림)

In [17]:
import numpy as np
import pandas as pd

In [18]:
df = pd.read_csv('./data/basic1.csv')

display(df.head(), df.shape)

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

(100, 8)

In [19]:
df = df.sort_values(['f4', 'f5'], ascending=[False, True]).reset_index(drop=True)
df['f5'][:10] = df['f5'][:10].min()

print(round(df['f5'].mean(),2))

53.63

### Question 3
- 'age' 컬럼의 IQR방식을 이용한 이상치 수와 표준편차*1.5방식을 이용한 이상치 수 합을 구하시오
- IQR방식 : Q1 - 1.5 IQR, Q3 + 1.5 IQR에서 벗어나는 영역을 이상치라고 판단함 (Q1은 데이터의 25%, Q3는 데이터의 75% 지점임)
- 표준편차1.5방식: 평균으로부터 '표준편차1.5'를 벗어나는 영역을 이상치라고 판단함

In [20]:
q1 = df['age'].quantile(0.25)
q3 = df['age'].quantile(0.75)

iqr = q3-q1
cut_off = 1.5*iqr

lower = q1 - cut_off
upper = q3 + cut_off

lower, upper

(-48.3125, 152.1875)

In [21]:
mean = df['age'].mean()
std = df['age'].std() * 1.5

low = mean - std
high = mean + std

low, high

(5.298862216116952, 96.62713778388303)

In [22]:
iqr_age = len(df[(df['age'] < lower) | (df['age'] > upper)])
std_age = len(df[(df['age'] < low) | (df['age'] > high)])

print(iqr_age + std_age)

14